/*
	Script : reward_cbt
	Support : rAthena
	Editor by : DurexzOfficial
	Commit Version :
		Ver.1.0 สิทธิ์ในการรับไอเทมจาก account_id ที่กรอกลงไปเท่านั้น
		Ver.1.1 เพิ่มข้อความคำอธิบาย
*/

morocc,169,81,4	script	รางวัลเวล99#CBT	123,{
	setarray .@acc_id
,2000321
,2000334
,2000345
,2000404
,2000406
,2000760
,2000827
,2001197
,2000875
,2001010
,2001032
,2001033
,2001034
,2001278
,2001390
,2000596
,2000041
,2001358
,2000373
,2000294
,2000034
,2000169
,2000004
,2000017
,2001228
,2000173
,2001077
,2001127
,2000385
,2000346
,2001037
,2001068
,2001323
,2000344
,2000405
,2000082
,2000247
,2000131
,2000015
,2000278
,2000328
,2000922
,2000538
,2000539
,2001365
,2000565
,2000191
,2000764
,2001110
,2000039
,2000643
,2000715
,2001165
,2001381
,2001395
,2000221
,2000046
,2001102
,2001132
,2001111
,2001047
,2001122
,2000468
,2000833
,2000834
,2000470
,2000471
,2000473
,2000475
,2000828
,2000829
,2000830
,2001375
,2000166
,2000641
,2001345
,2000147
,2001200
,2001276
,2001283
,2001313;
//account_id ที่ต้องการให้รับไอเทม
	setarray .@item_id[0],53000015,23210; // item_id ที่ต้องการแจก
	setarray .@amount[0],1,5; // จำนวนไอเทมที่ต้องการแจก
	
	if(#reward_lv90 == 1){
		mes "ท่านเคยรับไอเทมไปแล้ว";
		end;
	}
	
	mes .NPCname$;
	mes "ยินดีต้อนรับท่าน ^FF0000"+strcharinfo(0)+"^000000";
	mes "ท่านเคยเลเวล 99 ในตอน CBT ใช่หรือไม่";
	mes "ท่านต้องการรับไอเท็มใช่หรือไม่??";
	next;
	switch(select("~ แน่นอน :~ ยังก่อน...")){
		case 1:
			for( .@i = 0; .@i < getarraysize(.@acc_id); .@i++ ){
				if( getcharid(3) == .@acc_id[.@i]){
					for( .@k = 0; .@k < getarraysize(.@item_id); .@k++){
						getitem .@item_id[.@k],.@amount[.@k];
						dispbottom "ท่านได้รับไอเทม "+getitemname(.@item_id[.@k])+" จำนวน "+.@amount[.@k]+" Ea.";
					}
					#CASHPOINTS += 20000;
					#reward_lv90 = 1;
					announce "ผู้เล่น [" +strcharinfo(0)+ "] ได้รับไอเท็มจากกิจกรรม CBT เลเวล 99 เรียบร้อยแล้ว",bc_blue|bc_all;
					end;
				}
			}
		mes "ท่านไม่สิทธิ์ในการรับไอเทม";
		end;
	}
	
OnInit:
	.NPCname$ = "[^0000FF "+strnpcinfo(1)+" ^000000]";
	waitingroom "รับรางวัลLv99 CBT",0;
	end;
}